STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32G0xx/Include/stm32g0xxxxx.h
/**
  ******************************************************************************
  * @file    $PRODUCTNAME_LC$.h
  * @author  MCD Application Team
  * @brief   CMSIS Cortex-M0+ Device Peripheral Access Layer Header File.
  *          This file contains all the peripheral register's definitions, bits
  *          definitions and memory mapping for $PRODUCTNAME_LC$ devices.
  *
  *          This file contains:
  *           - Data structures and the address mapping for all peripherals
  *           - Peripheral's registers declarations and bits definition
  *           - Macros to access peripheral's registers hardware
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2018-2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/** @addtogroup CMSIS_Device
  * @{
  */

/** @addtogroup $PRODUCTNAME_LC$
  * @{
  */

#ifndef $PRODUCTNAME_UC$_H
#define $PRODUCTNAME_UC$_H

#ifdef __cplusplus
 extern "C" {
#endif /* __cplusplus */

/** @addtogroup Configuration_section_for_CMSIS
  * @{
  */

/**
  * @brief Configuration of the Cortex-M0+ Processor and Core Peripherals
   */
#define __CM0PLUS_REV             0U /*!< Core Revision r0p0                            */
#define __MPU_PRESENT             1U /*!< STM32G0xx  provides an MPU                    */
#define __VTOR_PRESENT            1U /*!< Vector  Table  Register supported             */
#define __NVIC_PRIO_BITS          2U /*!< STM32G0xx uses 2 Bits for the Priority Levels */
#define __Vendor_SysTickConfig    0U /*!< Set to 1 if different SysTick Config is used  */

/**
  * @}
  */

/** @addtogroup Peripheral_interrupt_number_definition
  * @{
  */

/**
 * @brief $PRODUCTNAME_LC$ Interrupt Number Definition, according to the selected device
 *        in @ref Library_configuration_section
 */

/*!< Interrupt Number Definition */
typedef enum
{
/******  Cortex-M0+ Processor Exceptions Numbers ***************************************************************/
  NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt                                          */
  HardFault_IRQn              = -13,    /*!< 3 Cortex-M Hard Fault Interrupt                                   */
  SVCall_IRQn                 = -5,     /*!< 11 Cortex-M SV Call Interrupt                                     */
  PendSV_IRQn                 = -2,     /*!< 14 Cortex-M Pend SV Interrupt                                     */
  SysTick_IRQn                = -1,     /*!< 15 Cortex-M System Tick Interrupt                                 */
/******  STM32G0xxxx specific Interrupt Numbers ****************************************************************/
  WWDG_IRQn                   = 0,      /*!< Window WatchDog Interrupt                                         */
#if defined(STM32G0B1xx) || defined(STM32G0C1xx)
  PVD_VDDIO2_IRQn             = 1,      /*!< PVD through EXTI line 16, PVM (monit. VDDIO2) through EXTI line 34*/
#elif defined(STM32G071xx) || defined(STM32G081xx) || defined(STM32G031xx) || defined(STM32G041xx) || defined(STM32G0B1xx) || defined(STM32G0C1xx) || defined(STM32G051xx) || defined(STM32G061xx)
  PVD_IRQn                    = 1,      /*!< PVD through EXTI line 16                                          */
#endif
  RTC_TAMP_IRQn               = 2,      /*!< RTC interrupt through the EXTI line 19 & 21                       */
  FLASH_IRQn                  = 3,      /*!< FLASH global Interrupt                                            */
#if defined(STM32G0C1xx) || defined(STM32G0B1xx)
  RCC_CRS_IRQn                = 4,      /*!< RCC and CRS global Interrupt                                      */
#else
  RCC_IRQn                    = 4,      /*!< RCC global Interrupt                                              */
#endif
  EXTI0_1_IRQn                = 5,      /*!< EXTI 0 and 1 Interrupts                                           */
  EXTI2_3_IRQn                = 6,      /*!< EXTI Line 2 and 3 Interrupts                                      */
  EXTI4_15_IRQn               = 7,      /*!< EXTI Line 4 to 15 Interrupts                                      */
#if defined(STM32G0B1xx) || defined(STM32G0C1xx)
  USB_UCPD1_2_IRQn            = 8,      /*!< USB, UCPD1 and UCPD2 global Interrupt                             */
#elif defined(STM32G0B0xx)
  USB_IRQn                    = 8,      /*!< USB Interrupt                                                     */
#elif defined(STM32G071xx) || defined(STM32G081xx)
  UCPD1_2_IRQn                = 8,      /*!< UCPD1 and UCPD2 global Interrupt                                  */
#endif
  DMA1_Channel1_IRQn          = 9,      /*!< DMA1 Channel 1 Interrupt                                          */
  DMA1_Channel2_3_IRQn        = 10,     /*!< DMA1 Channel 2 and Channel 3 Interrupts                           */
#if defined(STM32G071xx) || defined(STM32G081xx) || defined(STM32G070xx) || defined(STM32G051xx) || defined(STM32G061xx) || defined(STM32G050xx)
  DMA1_Ch4_7_DMAMUX1_OVR_IRQn = 11,     /*!< DMA1 Channel 4 to Channel 7 and DMAMUX1 Overrun Interrupts        */
#elif defined(STM32G031xx) || defined(STM32G041xx) || defined(STM32G030xx)
  DMA1_Ch4_5_DMAMUX1_OVR_IRQn = 11,     /*!< DMA1 Channel 4 to Channel 5 and DMAMUX1 Overrun Interrupts        */
#elif defined(STM32G0C1xx) || defined(STM32G0B1xx) || defined(STM32G0B0xx)
  DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn = 11, /*!< DMA1 Ch4 to Ch7, DMA2 Ch1 to Ch5 and DMAMUX1 Overrun Interrupts */
#endif
#if defined(STM32G0B1xx) || defined(STM32G0C1xx)
  ADC1_COMP_IRQn              = 12,     /*!< ADC1, COMP1,COMP2, COMP3 Interrupts (combined with EXTI 17 & 18)  */
#elif defined(STM32G071xx) || defined(STM32G081xx)|| defined(STM32G051xx) || defined(STM32G061xx)
  ADC1_COMP_IRQn              = 12,     /*!< ADC1, COMP1 and COMP2 Interrupts (combined with EXTI 17 & 18)     */
#else
  ADC1_IRQn                   = 12,     /*!< ADC1 Interrupts                                                   */
#endif
  TIM1_BRK_UP_TRG_COM_IRQn    = 13,     /*!< TIM1 Break, Update, Trigger and Commutation Interrupts            */
  TIM1_CC_IRQn                = 14,     /*!< TIM1 Capture Compare Interrupt                                    */
#if defined(STM32G071xx) || defined(STM32G081xx) || defined(STM32G031xx) || defined(STM32G041xx) || defined(STM32G0B1xx) || defined(STM32G0C1xx) || defined(STM32G051xx) || defined(STM32G061xx)
  TIM2_IRQn                   = 15,     /*!< TIM2 Interrupt                                                    */
#endif
#if defined(STM32G0B1xx) || defined(STM32G0C1xx) || defined(STM32G0B0xx)
  TIM3_TIM4_IRQn              = 16,     /*!< TIM3, TIM4 global Interrupt                                       */
#else
  TIM3_IRQn                   = 16,     /*!< TIM3 global Interrupt                                             */
#endif
#if defined(STM32G071xx) || defined(STM32G081xx) || defined(STM32G0B1xx) || defined(STM32G0C1xx) || defined(STM32G051xx) || defined(STM32G061xx)
  TIM6_DAC_LPTIM1_IRQn        = 17,     /*!< TIM6, DAC and LPTIM1 global Interrupts                            */
#elif defined(STM32G031xx) || defined(STM32G041xx)
  LPTIM1_IRQn                 = 17,     /*!< LPTIM1 global Interrupts                                          */
#elif defined(STM32G070xx) || defined(STM32G0B0xx) || defined(STM32G050xx)
  TIM6_IRQn                   = 17,     /*!< TIM6 global Interrupts                                            */
#endif
#if defined(STM32G071xx) || defined(STM32G081xx) || defined(STM32G0B1xx) || defined(STM32G0C1xx) || defined(STM32G051xx) || defined(STM32G061xx)
  TIM7_LPTIM2_IRQn            = 18,     /*!< TIM7 and LPTIM2 global Interrupt                                  */
#elif defined(STM32G031xx) || defined(STM32G041xx)
  LPTIM2_IRQn                 = 18,     /*!< LPTIM2 global Interrupt                                           */
#elif defined(STM32G070xx) || defined(STM32G0B0xx) || defined(STM32G050xx)
  TIM7_IRQn                   = 18,     /*!< TIM7 global Interrupt                                             */
#endif
  TIM14_IRQn                  = 19,     /*!< TIM14 global Interrupt                                            */
#if defined(STM32G071xx) || defined(STM32G081xx) || defined(STM32G070xx) || defined(STM32G0B1xx) || defined(STM32G0C1xx) || defined(STM32G0B0xx) || defined(STM32G051xx) || defined(STM32G061xx) || defined(STM32G050xx)
  TIM15_IRQn                  = 20,     /*!< TIM15 global Interrupt                                            */
#endif
#if defined(STM32G0B1xx) || defined(STM32G0C1xx)
  TIM16_FDCAN_IT0_IRQn        = 21,     /*!< TIM16, FDCAN1_IT0 and FDCAN2_IT0 Interrupt                        */
#else
  TIM16_IRQn                  = 21,     /*!< TIM16 global Interrupt                                            */
#endif
#if defined(STM32G0B1xx) || defined(STM32G0C1xx)
  TIM17_FDCAN_IT1_IRQn        = 22,     /*!< TIM17, FDCAN1_IT1 and FDCAN2_IT1 Interrupt                        */
#else
  TIM17_IRQn                  = 22,     /*!< TIM17 global Interrupt                                            */
#endif
  I2C1_IRQn                   = 23,     /*!< I2C1 Interrupt  (combined with EXTI 23)                           */
#if defined(STM32G0B1xx) || defined(STM32G0C1xx) || defined(STM32G0B0xx)
  I2C2_3_IRQn                 = 24,     /*!< I2C2, I2C3 Interrupt (combined with EXTI 24 and EXTI 22)          */
#else
  I2C2_IRQn                   = 24,     /*!< I2C2 Interrupt                                                    */
#endif
  SPI1_IRQn                   = 25,     /*!< SPI1/I2S1 Interrupt                                               */
#if defined(STM32G0B1xx) || defined(STM32G0C1xx) || defined(STM32G0B0xx)
  SPI2_3_IRQn                 = 26,     /*!< SPI2/I2S2, SPI3/I2S3 Interrupt                                    */
#else
  SPI2_IRQn                   = 26,     /*!< SPI2 Interrupt                                                    */
#endif
  USART1_IRQn                 = 27,     /*!< USART1 Interrupt                                                  */
#if defined(STM32G0B1xx) || defined(STM32G0C1xx)
  USART2_LPUART2_IRQn         = 28,     /*!< USART2 + LPUART2 Interrupt                                        */
#else
  USART2_IRQn                 = 28,     /*!< USART2 Interrupt                                                  */
#endif
#if defined(STM32G0B1xx) || defined(STM32G0C1xx)
  USART3_4_5_6_LPUART1_IRQn   = 29,     /*!< USART3, USART4, USART5, USART6, LPUART1 globlal Interrupts (combined with EXTI 28) */
#elif defined(STM32G0B0xx)
  USART3_4_5_6_IRQn           = 29,     /*!< USART3, USART4, USART5, USART6 globlal Interrupts (combined with EXTI 28) */
#elif defined(STM32G070xx)
  USART3_4_IRQn               = 29,     /*!< USART3, USART4 globlal Interrupts                                 */
#elif defined(STM32G071xx) || defined(STM32G081xx)
  USART3_4_LPUART1_IRQn       = 29,     /*!< USART3, USART4 and LPUART1 globlal Interrupts (combined with EXTI 28) */
#elif defined(STM32G031xx) || defined(STM32G041xx) || defined(STM32G051xx) || defined(STM32G061xx)
  LPUART1_IRQn                = 29,     /*!< LPUART1 globlal Interrupts (combined with EXTI 28)                 */
#endif
#if defined(STM32G071xx) || defined(STM32G081xx) || defined(STM32G0B1xx) || defined(STM32G0C1xx)
  CEC_IRQn                    = 30,     /*!< CEC Interrupt(combined with EXTI 27)                               */
#endif
#if defined (STM32G081xx) || defined (STM32G041xx) || defined(STM32G0C1xx) || defined(STM32G061xx)
  AES_RNG_IRQn                = 31,     /*!< AES & RNG Interrupt                                                */
#endif /* STM32G081xx */
} IRQn_Type;

/**
  * @}
  */

#include "core_cm0plus.h"               /* Cortex-M0+ processor and core peripherals */
#include "system_stm32g0xx.h"
#include <stdint.h>

