STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32G0xx/Include/stm32g0xxxxx.h
/****************** TIM Instances : supporting combined 3-phase PWM mode ******/
#define IS_TIM_COMBINED3PHASEPWM_INSTANCE(INSTANCE)    ((INSTANCE) == TIM1)

/****************** TIM Instances : supporting commutation event generation ***/
#if defined (STM32G031xx) || defined(STM32G041xx) || defined(STM32G030xx)
#define IS_TIM_COMMUTATION_EVENT_INSTANCE(INSTANCE) (((INSTANCE) == TIM1)   || \
                                                     ((INSTANCE) == TIM16)  || \
                                                     ((INSTANCE) == TIM17))
#else
#define IS_TIM_COMMUTATION_EVENT_INSTANCE(INSTANCE) (((INSTANCE) == TIM1)   || \
                                                     ((INSTANCE) == TIM15)  || \
                                                     ((INSTANCE) == TIM16)  || \
                                                     ((INSTANCE) == TIM17))
#endif

/****************** TIM Instances : supporting counting mode selection ********/
#if defined(STM32G0C1xx) || defined(STM32G0B1xx)
#define IS_TIM_COUNTER_MODE_SELECT_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1) || \
                                                        ((INSTANCE) == TIM2) || \
                                                        ((INSTANCE) == TIM3) || \
                                                        ((INSTANCE) == TIM4))
#elif defined (STM32G071xx) || defined(STM32G081xx) || defined (STM32G031xx) || defined(STM32G041xx) || defined(STM32G051xx) || defined(STM32G061xx)
#define IS_TIM_COUNTER_MODE_SELECT_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1) || \
                                                        ((INSTANCE) == TIM2) || \
                                                        ((INSTANCE) == TIM3))
#elif defined(STM32G0B0xx)
#define IS_TIM_COUNTER_MODE_SELECT_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1) || \
                                                        ((INSTANCE) == TIM3) || \
                                                        ((INSTANCE) == TIM4))
#elif defined (STM32G070xx) || defined (STM32G030xx) || defined(STM32G050xx)
#define IS_TIM_COUNTER_MODE_SELECT_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1) || \
                                                        ((INSTANCE) == TIM3))
#endif

/****************** TIM Instances : supporting encoder interface **************/
#if defined(STM32G0C1xx) || defined(STM32G0B1xx)
#define IS_TIM_ENCODER_INTERFACE_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1)  || \
                                                      ((INSTANCE) == TIM2)  || \
                                                      ((INSTANCE) == TIM3)  || \
                                                      ((INSTANCE) == TIM4))
#elif defined (STM32G071xx) || defined(STM32G081xx) || defined (STM32G031xx) || defined(STM32G041xx) || defined(STM32G051xx) || defined(STM32G061xx)
#define IS_TIM_ENCODER_INTERFACE_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1)  || \
                                                      ((INSTANCE) == TIM2)  || \
                                                      ((INSTANCE) == TIM3))
#elif defined(STM32G0B0xx)
#define IS_TIM_ENCODER_INTERFACE_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1)  || \
                                                      ((INSTANCE) == TIM3)  || \
                                                      ((INSTANCE) == TIM4))
#elif defined (STM32G070xx) || defined (STM32G030xx) || defined(STM32G050xx)
#define IS_TIM_ENCODER_INTERFACE_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1)  || \
                                                      ((INSTANCE) == TIM3))
#endif

/****************** TIM Instances : supporting Hall sensor interface **********/
#if defined(STM32G0C1xx) || defined(STM32G0B1xx)
#define IS_TIM_HALL_SENSOR_INTERFACE_INSTANCE(INSTANCE) (((INSTANCE) == TIM1)   || \
                                                         ((INSTANCE) == TIM2)   || \
                                                         ((INSTANCE) == TIM3)   || \
                                                         ((INSTANCE) == TIM4))
#elif defined (STM32G071xx) || defined(STM32G081xx) || defined (STM32G031xx) || defined(STM32G041xx) || defined(STM32G051xx) || defined(STM32G061xx)
#define IS_TIM_HALL_SENSOR_INTERFACE_INSTANCE(INSTANCE) (((INSTANCE) == TIM1)   || \
                                                         ((INSTANCE) == TIM2)   || \
                                                         ((INSTANCE) == TIM3))
#elif defined (STM32G0B0xx)
#define IS_TIM_HALL_SENSOR_INTERFACE_INSTANCE(INSTANCE) (((INSTANCE) == TIM1)   || \
                                                         ((INSTANCE) == TIM3)   || \
                                                         ((INSTANCE) == TIM4))
#elif defined (STM32G070xx) || defined (STM32G030xx) || defined(STM32G050xx)
#define IS_TIM_HALL_SENSOR_INTERFACE_INSTANCE(INSTANCE) (((INSTANCE) == TIM1)   || \
                                                         ((INSTANCE) == TIM3))
#endif

/**************** TIM Instances : external trigger input available ************/
#if defined(STM32G0C1xx) || defined(STM32G0B1xx)
#define IS_TIM_ETR_INSTANCE(INSTANCE)      (((INSTANCE) == TIM1)  || \
                                            ((INSTANCE) == TIM2)  || \
                                            ((INSTANCE) == TIM3)  || \
                                            ((INSTANCE) == TIM4))
#elif defined (STM32G071xx) || defined(STM32G081xx) || defined (STM32G031xx) || defined(STM32G041xx) || defined(STM32G051xx) || defined(STM32G061xx)
#define IS_TIM_ETR_INSTANCE(INSTANCE)      (((INSTANCE) == TIM1)  || \
                                            ((INSTANCE) == TIM2)  || \
                                            ((INSTANCE) == TIM3))
#elif defined (STM32G0B0xx)
#define IS_TIM_ETR_INSTANCE(INSTANCE)      (((INSTANCE) == TIM1)  || \
                                            ((INSTANCE) == TIM3)  || \
                                            ((INSTANCE) == TIM4))
#elif defined (STM32G070xx) || defined (STM32G030xx) || defined(STM32G050xx)
#define IS_TIM_ETR_INSTANCE(INSTANCE)      (((INSTANCE) == TIM1)  || \
                                            ((INSTANCE) == TIM3))
#endif

/************* TIM Instances : supporting ETR source selection ***************/
#if defined(STM32G0C1xx) || defined(STM32G0B1xx)
#define IS_TIM_ETRSEL_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1)  || \
                                             ((INSTANCE) == TIM2)  || \
                                             ((INSTANCE) == TIM3)  || \
                                             ((INSTANCE) == TIM4))
#elif defined (STM32G071xx) || defined(STM32G081xx) || defined (STM32G031xx) || defined(STM32G041xx) || defined(STM32G051xx) || defined(STM32G061xx)
#define IS_TIM_ETRSEL_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1)  || \
                                             ((INSTANCE) == TIM2)  || \
                                             ((INSTANCE) == TIM3))
#elif defined (STM32G0B0xx)
#define IS_TIM_ETRSEL_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1)  || \
                                             ((INSTANCE) == TIM3)  || \
                                             ((INSTANCE) == TIM4))
#elif defined (STM32G070xx) || defined (STM32G030xx) || defined(STM32G050xx)
#define IS_TIM_ETRSEL_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1)  || \
                                             ((INSTANCE) == TIM3))
#endif

