STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32G0xx/Include/stm32g0xxxxx.h
/****************** UART Instances : SPI Slave selection mode ***************/
#if defined (STM32G0C1xx) || defined(STM32G0B1xx) || defined(STM32G0B0xx)
#define IS_UART_SPI_SLAVE_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                              ((INSTANCE) == USART2) || \
                                              ((INSTANCE) == USART3) || \
                                              ((INSTANCE) == USART4) || \
                                              ((INSTANCE) == USART5) || \
                                              ((INSTANCE) == USART6))
#elif defined(STM32G071xx) || defined(STM32G081xx) || defined(STM32G070xx)
#define IS_UART_SPI_SLAVE_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                              ((INSTANCE) == USART2) || \
                                              ((INSTANCE) == USART3) || \
                                              ((INSTANCE) == USART4))

#else
#define IS_UART_SPI_SLAVE_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                              ((INSTANCE) == USART2))
#endif

/****************** UART Instances : Driver Enable *****************/
#if defined (STM32G0C1xx) || defined(STM32G0B1xx)
#define IS_UART_FIFO_INSTANCE(INSTANCE)     (((INSTANCE) == USART1) || \
                                             ((INSTANCE) == USART2) || \
                                             ((INSTANCE) == USART3) || \
                                             ((INSTANCE) == LPUART1) || \
                                             ((INSTANCE) == LPUART2))
#elif defined(STM32G0B0xx)
#define IS_UART_FIFO_INSTANCE(INSTANCE)     (((INSTANCE) == USART1) || \
                                             ((INSTANCE) == USART2) || \
                                             ((INSTANCE) == USART3))
#elif defined(STM32G071xx) || defined(STM32G081xx)
#define IS_UART_FIFO_INSTANCE(INSTANCE)     (((INSTANCE) == USART1) || \
                                             ((INSTANCE) == USART2) || \
                                             ((INSTANCE) == LPUART1))
#elif defined(STM32G031xx) || defined(STM32G041xx) || defined (STM32G051xx) || defined(STM32G061xx)
#define IS_UART_FIFO_INSTANCE(INSTANCE)     (((INSTANCE) == USART1) || \
                                             ((INSTANCE) == LPUART1))
#elif defined(STM32G070xx)
#define IS_UART_FIFO_INSTANCE(INSTANCE)     (((INSTANCE) == USART1) || \
                                             ((INSTANCE) == USART2))
#elif defined(STM32G030xx) || defined (STM32G050xx)
#define IS_UART_FIFO_INSTANCE(INSTANCE)     ((INSTANCE) == USART1)
#endif

/*********************** UART Instances : IRDA mode ***************************/
#if defined (STM32G0C1xx) || defined(STM32G0B1xx) || defined(STM32G0B0xx)
#define IS_IRDA_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                    ((INSTANCE) == USART2) || \
                                    ((INSTANCE) == USART3))
#elif defined(STM32G071xx) || defined(STM32G081xx) || defined(STM32G070xx)
#define IS_IRDA_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                    ((INSTANCE) == USART2))
#else
#define IS_IRDA_INSTANCE(INSTANCE) ((INSTANCE) == USART1)
#endif

#if defined (STM32G0C1xx) || defined(STM32G0B1xx)
/******************** LPUART Instance *****************************************/
#define IS_LPUART_INSTANCE(INSTANCE) (((INSTANCE) == LPUART1) || \
                                      ((INSTANCE) == LPUART2))
#elif defined(STM32G071xx) || defined(STM32G081xx) || defined(STM32G031xx) || defined(STM32G041xx) || defined (STM32G051xx) || defined(STM32G061xx)
/******************** LPUART Instance *****************************************/
#define IS_LPUART_INSTANCE(INSTANCE)    ((INSTANCE) == LPUART1)
#else
#define IS_LPUART_INSTANCE(INSTANCE)    (0U)
#endif

/****************************** IWDG Instances ********************************/
#define IS_IWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == IWDG)

/****************************** WWDG Instances ********************************/
#define IS_WWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == WWDG)

#if defined (STM32G071xx) || defined(STM32G081xx) || defined (STM32G0C1xx) || defined(STM32G0B1xx)
/****************************** UCPD Instances ********************************/
#define IS_UCPD_ALL_INSTANCE(INSTANCE)  (((INSTANCE) == UCPD1) || \
                                         ((INSTANCE) == UCPD2))
#endif

#if defined (STM32G0C1xx) || defined(STM32G0B1xx) || defined(STM32G0B0xx)
/****************************** USB Instances ********************************/
#define IS_USB_ALL_INSTANCE(INSTANCE) ((INSTANCE) == USB_DRD_FS)

/*********************** USB OTG PCD Instances ********************************/
#define IS_PCD_ALL_INSTANCE(INSTANCE) (((INSTANCE) == USB_DRD_FS))

/*********************** USB OTG HCD Instances ********************************/
#define IS_HCD_ALL_INSTANCE(INSTANCE) (((INSTANCE) == USB_DRD_FS))

#endif
/******************************************************************************/
/*  For a painless codes migration between the STM32G0xx device product       */
/*  lines, the aliases defined below are put in place to overcome the         */
/*  differences in the interrupt handlers and IRQn definitions.               */
/*  No need to update developed interrupt code when moving across             */
/*  product lines within the same STM32G0 Family                              */
/******************************************************************************/
/* Aliases for IRQn_Type */
#define SVC_IRQn              SVCall_IRQn

/**
  * @}
  */

 /**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* $PRODUCTNAME_UC$_H */

/**
  * @}
  */

  /**
  * @}
  */
